HomeWork103forEDT/src/Documents/УстановкаСкидок/УстановкаСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидок</name>
  <registerRecords>InformationRegister.Скидки</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

HomeWork103forEDT/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HomeWork103forEDT/src/Documents/УстановкаСкидок/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Скидки.Очистить();
	Движения.Скидки.Записать();
	Движения.Скидки.Записывать = Истина;
	
	Для Каждого ТекСтрока Из Скидки Цикл
		
		Движение = Движения.Скидки.Добавить();
		Движение.Период = Дата;
		Движение.НоменклатураНоменклатурнаяГруппа = ТекСтрока.Номенклатура;
		Движение.Скидка = ТекСтрока.Скидка;
		
	КонецЦикла;
	
КонецПроцедуры
